app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "jasin etemi"], ["user_id", 1], ["created_at", "2023-02-28 18:26:19.658595"], ["updated_at", "2023-02-28 18:26:19.658595"]]
---
    def create
        message = current_user.messages.build(message_params)
        if message.save